{"agency":"NASA","generated":"2014-06-23 11:14:23","items":[{"id":"2.1","parent":null,"text":"Engage with customers to identify at least two existing major customer-facing services that contain high-value data or content as first-move candidates to make compliant with new open data, content, and web API policy.","due":"90 Days","due_date":"2012\/08\/21","fields":[{"type":"select","name":"2-1-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"}],"multiple":false},{"id":"2.1.1","parent":"2.1","text":"Paragraph on customer engagement approach","due":"90 days","due_date":"2012\/08\/21","fields":[{"type":"textarea","name":"2-1-1-customer-engagement-approach","label":"Paragraph on customer engagement approach","options":[],"value":"Code.nasa.gov and data.nasa.gov are two major ways that NASA engages our customers. Code.nasa.gov website expands NASA’s open source activities, surfaces existing activities, provides a discussion forum, and guides internal and external groups in open development, release, and contribution.NASA hoped to lower barriers to building open technology in partnership with the public. Phase two concentrates on discussion of open source concepts, policies, and activities at NASA. The third phase focuses on building software tools to improve and speed open source development (distributed version control, issue tracking, continuous integration, documentation, communication, and planning\/management). Data.nasa.gov is NASA’s commitment to open data expands the audience for the vast body of knowledge captured in nearly 100 years of U.S. aeronautics and space data. Developers, technologists, entrepreneurs, citizen scientists and many others can contribute directly to the exploration of space and Earth by helping to create new ways of looking at this data. Additionally, the release of administrative and procedural information from within NASA enables researchers and analysts to understand more about the inner workings of NASA as well as allow our own employees to better understand other functions of our Agency. As part of the Open Government Initiative, the Agency is working to improve accessibility to this data and incentivizing the use of government data by citizens. To address the ever-increasing amount of tools and data catalogs that are publicly available on NASA’s many websites, this directory lists publicly available datasets and serves to streamline the process for posting these datasets on data.gov. The directory includes information and direct links to approximately 100 datasets, and this is just a small beginning."}],"multiple":false},{"id":"2.1.2","parent":"2.1","text":"Prioritized list of systems (datasets)","due":"90 days","due_date":"2012\/08\/21","fields":[{"type":"text","name":"2-1-2-name","label":"System Name","options":[],"value":["NASA Data API","ISS Live API","ExoAPI"]},{"type":"text","name":"2-1-2-description","label":"System Description","options":[],"value":["The data.nasa.gov API allows a machine-readable interface to return metadata from the site organized by category, tag, date, or search term. We’re hoping this allows new and creative visualizations of the data resources NASA provides to the public. Additionally, it is a learning experience for us as we work to expand transparency, participation, and collaboration at NASA through new uses of technology.","Thousands of data points are downloaded every minute from the Station, and ISS Live! makes a broad set of that data open and accessible. Furthermore,  ISS Live! will make an application programming interface (API) available as a web service for external developers to take ISS data and put it into their own websites and mobile applications.","ExoAPI is an ongoing project that extends the accessibility of exoplanetary data by providing an easy to use RESTful API. ExoAPI was created during the NASA Space Apps Challenge by a team of three amazing geniuses who knew nothing about space before they started this...and still don't really. Currently the data is provided by http:\/\/exoplanetology.blogspot.com\/ who in turn feeds the data from http:\/\/exoplanet.eu\/. The ExoAPI team plans on extending the API to encompass a wider array of data sources and more interesting space data to reach as many programmers as possible and encourage an explosion of space data based mashups. "]},{"type":"select","name":"2-1-2-scope","label":"System Scope","options":[{"label":"Internal","value":"internal"},{"label":"External","value":"external"},{"label":"Both","value":"both"}],"value":["both","both","both"]},{"type":"text","name":"2-1-2-customer","label":"Main Customer","options":[],"value":["Employees, Citizens","Employees, Citizens","Employees, Citizens"]},{"type":"text","name":"2-1-2-uii","label":"Unique Investment Identifier","options":[],"value":["026-000000001","026-000000001","026-000000001"]}],"multiple":true},{"id":"7.1","parent":null,"text":"Engage with customers to identify at least two existing priority customer-facing services to optimize for mobile use.","due":"90 Days","due_date":"2012\/08\/21","fields":[{"type":"select","name":"7-1-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"}],"multiple":false},{"id":"7.1.1","parent":"7.1","text":"Paragraph on customer engagement approach","due":"90 days","due_date":"2012\/08\/21","fields":[{"type":"textarea","name":"7-1-1-customer-engagement-approach","label":"Paragraph on customer engagement approach","options":[],"value":"In June, 2012 NASA held a Mobility Summit at Kennedy Space Center with all the Center Chief Technology Officers (CTO) for IT who worked as the CTO Council to craft an Agency vision and strategy for Agency mobility. NASA's mobility vision is articulated as, \"Anyone will be able to securely and seamlessly access and share any information, anyplace, anytime, with any device.\" The following identified activities are projected: Publish NASA Mobile application development and release standards; Publish Mobile Computing guidelines - ensuring that all newly provisioned services are device agnostic; Publish NASA standard mobility practices; Prepare communications and support to enable a mobile workforce.\r\n"}],"multiple":false},{"id":"7.1.2","parent":"7.1","text":"Prioritized list of systems (datasets)","due":"90 days","due_date":"2012\/08\/21","fields":[{"type":"text","name":"7-1-2-name","label":"System Name","options":[],"value":["NASA Apps Store","WebTADS","Visualization Explorer","people.nasa.gov"]},{"type":"text","name":"7-1-2-description","label":"System Description","options":[],"value":["Provide employees and contractors with access to agency data and systems on the go.","WebTADS Mobile is a lighter version of the desktop-based WebTADS developed to provide NASA Civil Servants with the convenience of recording time when they're not in the office or connected via VPN.","NASA Visualization Explorer, the coolest way to get stories about advanced space-based research delivered right to your iPad. A direct connection to NASA’s extraordinary fleet of research spacecraft, this app presents cutting edge research stories in an engaging and exciting format. ","NASA Enterprise Directory (NED) Search"]},{"type":"select","name":"7-1-2-scope","label":"System Scope","options":[{"label":"Internal","value":"internal"},{"label":"External","value":"external"},{"label":"Both","value":"both"}],"value":["internal","internal","both","both"]},{"type":"text","name":"7-1-2-customer","label":"Main Customer","options":[],"value":["Employees","Employees","Employees, Citizens","Employees, Citizens"]},{"type":"text","name":"7-1-2-uii","label":"Unique Investment Identifier","options":[],"value":["026-000000001","026-000000001","026-000004110","026-000000001"]}],"multiple":true},{"id":"4.2","parent":null,"text":"Establish an agency-wide governance structure for developing and delivering digital services","due":"6 months","due_date":"2012\/11\/23","fields":[{"type":"select","name":"4-2-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"},{"type":"textarea","name":"4-2-policy","label":"Paragraph on Governance","options":[],"value":"In responding to Milestone 4.2 of the Digital Government Strategy, NASA heeded the Advisory Group’s encouragement to “build upon existing structures and processes as much as possible.”  To locate the gaps in existing governance structures, NASA’s Digital Strategy response team identified all necessary decisions concerning digital services, using the three layers pointed out in the Digital Strategy—information, platform, presentation—as a guide."},{"type":"text","name":"4-2-link","label":"URL to Governance Document","options":[],"value":"http:\/\/www.nasa.gov\/agency\/digitalstrategy\/governance.html"}],"multiple":false},{"id":"5.2","parent":null,"text":"Develop an enterprise-wide inventory of mobile devices and wireless service contracts","due":"6 months","due_date":"2012\/11\/23","fields":[{"type":"select","name":"5-2-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"}],"multiple":false},{"id":"5.2.1","parent":"5.2","text":"Develop wireless and mobile inventory","due":"6 months","due_date":"2012\/11\/23","fields":[{"type":"text","name":"5-2-1-component","label":"Bureau\/Component","options":[],"value":["OCIO"]},{"type":"select","name":"5-2-1-inventory-status","label":"Inventory Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":["completed"]}],"multiple":true},{"id":"8.2","parent":null,"text":"Implement performance and customer satisfaction measuring tools on all .gov websites","due":"8 months","due_date":"2013\/1\/22","fields":[{"type":"select","name":"8-2-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"}],"multiple":false},{"id":"8.2.1","parent":"8.2","text":"Implement performance measurement tool","due":"8 months","due_date":"2013\/1\/22","fields":[{"type":"select","name":"8-2-1-tool","label":"Implemented Digital Analytics Program","options":[{"label":"Yes","value":"yes"},{"label":"No","value":"no"}],"value":"yes"},{"type":"textarea","name":"8-2-1-implementation","label":"If Not, Describe Implementation","options":[],"value":null},{"type":"text","name":"8-2-1-percent","label":"Percent of websites covered","options":[],"value":"100"},{"type":"text","name":"8-2-1-url","label":"URL of performance data","options":[],"value":"https:\/\/www.google.com\/analytics\/web\/?authuser=1#my-reports\/N_nOya0_SVC3_IfT9hgbkw\/a33523145w60822123p68619810\/"}],"multiple":false},{"id":"8.2.2","parent":"8.2","text":"Implement customer satisfaction tool","due":"8 months","due_date":"2013\/1\/22","fields":[{"type":"textarea","name":"8-2-2-implementation","label":"Describe Implementation","options":[],"value":" The main www.nasa.gov website uses ForeSee Feedback analytics that enables the agency to offer the opportunity for citizens to volunteer allow the agency to follow their movements throughout the website before offering a short survey measuring their satisfaction at the conclusion of their visit."},{"type":"text","name":"8-2-2-url","label":"URL of performance data","options":[],"value":"http:\/\/www.nasa.gov\/pdf\/598263main_NASA%20Customer%20Service%20Plan.pdf"}],"multiple":false},{"id":"1.2","parent":null,"text":"Ensure all new IT systems follow the open data, content, and web API policy and operationalize agency.gov\/developer pages","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"select","name":"1-2-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"in-progress"}],"multiple":false},{"id":"1.2.1","parent":"1.2","text":"Document policy for architecting new IT systems for openness by default","due":"6 months","due_date":"2012\/11\/23","fields":[{"type":"textarea","name":"1-2-1-description","label":"Describe policy","options":[],"value":"NASA is in the process of reviewing the recently released open data policy. The agency's long tradition of sharing its work and research with the public mean that much of our data already meets the requirements laid out in the policy, and the agency plans a comprehensive response to ensure that additional data is released in formats that are open, accessible, and of value to the public.\r\nNASA is also currently working on contract language to be put in place for all new IT systems such that hooks are provided to allow exposure of data in a machine-readable manner.  Additionally, the NIAM team run out of OCIO is providing data guidelines and standards that show reference architectures and implementations for best-practices approaches to machine-readable data and data operability."}],"multiple":false},{"id":"1.2.4","parent":"1.2","text":"Develop Data Inventory Schedule - Summary","due":"17 months","due_date":"2013\/10\/23","fields":[{"type":"textarea","name":"1-2-4-data-inventory-schedule-summary","label":"Summarize the Inventory Schedule","options":[],"value":"The Inventory Schedule is not available as it is currently being developed.  "}],"multiple":false},{"id":"1.2.5","parent":"1.2","text":"Develop Data Inventory Schedule - Milestones","due":"17 months","due_date":"2013\/10\/23","fields":[{"type":"text","name":"1-2-5-data-inventory-schedule-milestones-title","label":"Title","options":[],"value":["Publication of updated PDL"]},{"type":"textarea","name":"1-2-5-data-inventory-schedule-milestones-description","label":"Description","options":[],"value":["This major effort consists of mapping currently known datasets to the Project Open Data Schema and ensuring publication into PDL JSON format for harvesting into data.gov.  "]},{"type":"text","name":"1-2-5-data-inventory-schedule-milestones-date","label":"Milestone Date","options":[],"value":["9\/30\/2014"]},{"type":"textarea","name":"1-2-5-data-inventory-schedule-milestones-expand-description","label":"Description of how this milestone expands the Inventory","options":[],"value":["This activity focuses on adding datasets."]},{"type":"textarea","name":"1-2-5-data-inventory-schedule-milestones-enrich-description","label":"Description of how this milestone enriches the Inventory","options":[],"value":["This activity focuses on adding datasets."]},{"type":"textarea","name":"1-2-5-data-inventory-schedule-milestones-open-description","label":"Description of how this milestone opens the Inventory","options":[],"value":["This activity focuses on adding datasets."]}],"multiple":true},{"id":"1.2.6","parent":"1.2","text":"Develop Customer Feedback Process","due":"17 months","due_date":"2013\/10\/23","fields":[{"type":"textarea","name":"1-2-6-customer-feedback-process","label":"Describe the agency's process to engage with customers","options":[],"value":"NASA engages with the public through a variety of avenues, perhaps the most relevant to the Digital Strategy initiative being our commitment to open data and open source software. Two platforms, data.nasa.gov and code.nasa.gov, serve as the home for the agency's efforts in these areas.\r\n\r\nCode.nasa.gov expands NASA’s open source activities, surfaces existing activities, and guides internal and external groups in open development, release, and contribution. In doing so, NASA hopes to lower barriers to building open technology in partnership with the public. Future plans for code.nasa.gov include closer integration with our GitHub presence (http:\/\/github.com\/nasa), as well as improved catalogs of our available APIs and software release processes.\r\n\r\nData.nasa.gov is NASA’s flagship platform for sharing information about the vast data we collect and store - over 100 years of U.S. aeronautics and space data. Developers, technologists, entrepreneurs, citizen scientists and many others can contribute directly to the exploration of space and Earth by helping to create new ways of looking at this data. As part of the Open Government Initiative, the Agency is working to improve accessibility to this data and incentivizing the use of government data by citizens. To address the ever-increasing amount of tools and data catalogs that are publicly available on NASA’s many websites, this directory lists publicly available datasets and serves to streamline the process for posting these datasets on data.gov. The directory includes information and direct links to more than 1000 datasets."}],"multiple":false},{"id":"1.2.7","parent":"1.2","text":"Develop Data Publication Process","due":"17 months","due_date":"2013\/10\/23","fields":[{"type":"textarea","name":"1-2-7-data-publication-process","label":"Describe the agency's data publication process","options":[],"value":"NASA hosts data across several programs and projects and provides a meta-data publication hub on data.nasa.gov.  Using data.nasa.gov to allow CRUD operations on identified data sets for our agency PDL, will allow NASA to push data to data.gov for publication."}],"multiple":false},{"id":"2.2","parent":null,"text":"Make high-value data and content in at least two existing, major customer-facing systems available through web APIs, apply metadata tagging and publish a plan to transition additional high-value systems","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"select","name":"2-2-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"}],"multiple":false},{"id":"2.2.1","parent":"2.1","text":"Publish plan on future activity","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"textarea","name":"2-2-1-describe","label":"Describe policy","options":[],"value":"NASA sees huge promise in the ability of web APIs to enhance our ability to deliver data to both traditional and new audiences. Although the agency has petabytes of data publicly available to the world from a variety of missions, only a small portion is accessible through API interfaces. With constrained budgetary resources and the large, complex, and legacy systems our data is housed in, however, relying solely on NASA data owners to release APIs is not the best approach to opening our data to the world. Thus, our strategy has been to launch a series of challenges and collaboration opportunities to enable citizen developers around the world to help us in our quest to further the transparency and accessibility of NASA data systems. Events like the International Space Apps Challenge open the opportunity for thousands of citizen developers from across the planet to contribute their time to helping the agency create front end APIs for many of our legacy data systems.\r\n\r\nNASA has hosted two International Space Apps Challenge events - the first in April 2012 and the second in April 2013. In the 2013 event, 83 cities around the world with over 9,100 participants created 770 unique, open source solutions to a series of challenges the agency issued. The challenges varied in scope and subject, from the creation of visualizations of our data to designing more efficient Air Traffic Control systems to creating new API interfaces to legacy datasets. With relatively little investment from the agency, dozens of unique APIs were born out of the initiative, many of which are detailed in this report. Going forward, NASA hopes to hold more events like the Space Apps Challenge, in collaboration with our own internal efforts, to adopt these produced APIs and harness the power of citizen collaboration to assist us in reaching our goals."}],"multiple":false},{"id":"2.2.2","parent":"2.1","text":"Make 2+ systems (datasets) available via web APIs with metadata tags","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"text","name":"2-2-2-system","label":"Name of system","options":[],"value":["NASA Data API","Earth Observing System (EOS) Clearing House (ECHO)"]},{"type":"textarea","name":"2-2-2-description","label":"Description of system","options":[],"value":["The data.nasa.gov API allows a machine-readable interface to return metadata from the site organized by category, tag, date, or search term. We’re hoping this allows new and creative visualizations of the data resources NASA provides to the public. Additionally, it is a learning experience for us as we work to expand transparency, participation, and collaboration at NASA through new uses of technology.","The NASA-developed Earth Observing System (EOS) Clearinghouse (ECHO) is a spatial and temporal metadata registry and order broker built by NASA's Earth Science Data and Information System (ESDIS) that enables the science community to more easily use and exchange NASA's data and services. ECHO's main objective is to enable broader use of NASA's EOS data. It allows users to more efficiently search and access data and services and increases the potential for interoperability with new tools and services. The value of these resources increases as the potential to exchange and interoperate increases. ECHO has been working with other organizations to provide their Earth science metadata alongside NASA's for users to search and access. ECHO stores metadata from a variety of science disciplines and domains, including Climate Variability and Change, Carbon Cycle and Ecosystems, Earth Surface and Interior, Atmospheric Composition, Weather, and Water and Energy Cycle."]},{"type":"select","name":"2-2-2-scope","label":"Scope of system","options":[{"label":"Internal","value":"internal"},{"label":"External","value":"external"},{"label":"Both","value":"both"}],"value":["both","both"]},{"type":"text","name":"2-2-2-customers","label":"Main Customers","options":[],"value":["Employees, Public","Employees, Public"]},{"type":"text","name":"2-2-2-uii","label":"Unique Investment Identifier","options":[],"value":[" 026-000000001","026-000000001"]},{"type":"text","name":"2-2-2-url","label":"API Link","options":[],"value":["http:\/\/data.nasa.gov\/api-info\/","http:\/\/api.echo.nasa.gov\/echo\/"]}],"multiple":true},{"id":"5.3","parent":null,"text":"Evaluate the government-wide contract vehicles in the alternatives analysis for all new mobile-related procurements","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"select","name":"5-3-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"},{"type":"textarea","name":"5-3-policy","label":"Describe Implementation","options":[],"value":"As part of NASA's transition to ACES, the consolidated solution for delivering end-user services across the agency to achieve increased efficiencies and reduced costs through standardization, the agency undertook an extensive review of mobile device and service procurements. The agency offers employees a variety of device and service options, and is currently researching other opportunities for further flexibility in mobile services, including bring your own device programs and enhanced teleworking options."}],"multiple":false},{"id":"6.3","parent":null,"text":"Ensure all new digital services follow digital services and customer experience improvement guidelines","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"select","name":"6-3-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"},{"type":"textarea","name":"6-3-policy","label":"Describe Implementation","options":[],"value":"As part of NASA's Digital Governance, the agency is working to established improved digital service guidelines, many of which will come to fruition on the full launch of the agency's Web Services Initiative, which aims to transition the agency's web presence in to a modern, cloud-based, open source environment."}],"multiple":false},{"id":"7.2","parent":null,"text":"Optimize at least two existing priority customer-facing services for mobile use and publish a plan for improving additional existing services","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"select","name":"7-2-status","label":"Overall Status","options":[{"label":"Not Started","value":"not-started"},{"label":"In Progress","value":"in-progress"},{"label":"Completed","value":"completed"}],"value":"completed"},{"type":"textarea","name":"7-2-policy","label":"Describe Implementation","options":[],"value":"As mobile devices continue to count for a larger percentage of overall web traffic in the US, NASA has strived to offer a variety of services in mobile friendly offerings, including via specialized mobile applications, mobile optimized websites, and SMS gateways. With constrained budgetary resources, however, relying solely on NASA programs to release mobile interfaces is not the best approach to furthering this objective. Thus, our strategy has been to launch a series of challenges and collaboration opportunities to enable citizen developers around the world to help us in our quest to further the reach of NASA in to the mobile landscape. Events like the International Space Apps Challenge open the opportunity for thousands of citizen developers from across the planet to contribute their time to helping the agency create mobile interfaces for our programs."}],"multiple":false},{"id":"7.2.1","parent":"7.2.","text":"Report on services","due":"12 months","due_date":"2013\/05\/23","fields":[{"type":"text","name":"7-2-1-name","label":"Service Name","options":[],"value":["WebTADS Mobile","NASA Contacts"]},{"type":"textarea","name":"7-2-1-description","label":"Service Description","options":[],"value":["WebTADS Mobile is a lighter version of the desktop-based WebTADS developed to provide NASA Civil Servants with the convenience of recording time when they're not in the office or connected via VPN."," Look up your NASA colleagues' contact information directly from your phone."]},{"type":"select","name":"7-2-1-scope","label":"System Scope","options":[{"label":"Internal","value":"internal"},{"label":"External","value":"external"},{"label":"Both","value":"both"}],"value":["internal","internal"]},{"type":"text","name":"7-2-1-customers","label":"Primary customers","options":[],"value":["Employees","Employees"]},{"type":"text","name":"7-2-1-uii","label":"Unique Investment Identifier","options":[],"value":[]},{"type":"text","name":"7-2-1-url","label":"URL of service","options":[],"value":["https:\/\/apps.nasa.gov\/content\/webtads","https:\/\/apps.nasa.gov\/content\/nasa-contacts"]}],"multiple":true}]}